{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число: 384855\n",
      "Самая большая цифра этого числа равна 8\n"
     ]
    }
   ],
   "source": [
    "__author__ = 'Мария Худорожкова'\n",
    "\n",
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "# Подсказки:\n",
    "# * постарайтесь решить задачу с применением арифметики и цикла while;\n",
    "# * при желании и понимании решите задачу с применением цикла for.\n",
    "\n",
    "maxzahl = 0\n",
    "zahl = int(input('Введите число: '))\n",
    "while zahl != 0:\n",
    "    if zahl % 10 > maxzahl:\n",
    "        maxzahl = zahl % 10\n",
    "    zahl = zahl // 10\n",
    "print('Самая большая цифра этого числа равна', maxzahl)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите первое число: 41\n",
      "Введите второе число: 76\n",
      "76\n",
      "41\n"
     ]
    }
   ],
   "source": [
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Подсказки:\n",
    "# * постарайтесь сделать решение через действия над числами;\n",
    "# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.\n",
    "\n",
    "a = int(input('Введите первое число: '))\n",
    "b = int(input('Введите второе число: '))\n",
    "a = a + b\n",
    "b = a - b\n",
    "a = a - b\n",
    "print(a, b, sep='\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите коэффициент a: 3\n",
      "Введите коэффициент b: 9\n",
      "Введите коэффициент c: 5\n",
      "Уравнение имеет два корня: x1 = -0.74 , x2 = -2.26\n"
     ]
    }
   ],
   "source": [
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax² + bx + c = 0.\n",
    "# Коэффициенты уравнения вводятся пользователем.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "\n",
    "import math\n",
    "a = int(input('Введите коэффициент a: '))\n",
    "b = int(input('Введите коэффициент b: '))\n",
    "c = int(input('Введите коэффициент c: '))\n",
    "d = b ** 2 - 4 * a * c\n",
    "if d > 0:\n",
    "    x1 = (-b + math.sqrt(d)) / (a * 2)\n",
    "    x2 = (-b - math.sqrt(d)) / (a * 2)\n",
    "    print ('Уравнение имеет два корня:', 'x1 =', round(x1, 2), ', x2 =', round(x2, 2))\n",
    "elif d == 0:\n",
    "    x1 = -b / (a * 2)\n",
    "    print ('Уравнение имеет один корень:', 'x = ', round(x1, 2))\n",
    "else:\n",
    "    print ('Корней на множестве действительных чисел нет')\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
